InformationRegisters/КодыТНВЭДИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КодыТНВЭДИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыТНВЭДИСМП/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	Элементы.КлассификаторВыбрать.КнопкаПоУмолчанию = Не Параметры.РежимВыбора;
	Если Параметры.РежимВыбора Тогда
		Элементы.КлассификаторВыбрать.Заголовок = НСтр("ru = 'Выбрать'");
	Иначе
		Элементы.КлассификаторВыбрать.Заголовок = НСтр("ru = 'Загрузить'");
	КонецЕсли;
	
	ТекстЗапроса = "";
	ИнтеграцияИС.ОпределитьТекстЗапросаСопоставлениеКодовТНВЭД(ТекстЗапроса);
	Если ТекстЗапроса <> "" Тогда
		Список.ТекстЗапроса = ТекстЗапроса;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ВидПродукцииТоварнаяГруппа) Тогда
		
		ВходящиеВидыПродукции = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(Параметры.ВидПродукцииТоварнаяГруппа);
		Если ТипЗнч(ВходящиеВидыПродукции) = Тип("Массив") Тогда
			ВидыПродукции = Новый ФиксированныйМассив(ВходящиеВидыПродукции);
		Иначе
			ВидыПродукции = ВходящиеВидыПродукции;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "ВидПродукции", ВидыПродукции,,, Истина);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Классификатор, "ВидПродукции", ВидыПродукции,,, Истина);
		
		Элементы.СписокВидПродукции.Видимость        = Ложь;
		Элементы.КлассификаторВидПродукции.Видимость = Ложь;
		
	КонецЕсли;
	
	ВозвращатьСсылкуНаЭлементКлассификатора = Параметры.ВозвращатьСсылкуНаЭлементКлассификатора;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ОбработкаВыбораЗначенияСписка(Элемент.ТекущаяСтрока, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработкаВыбораЗначенияСписка(ВыбраннаяСтрока, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКлассификатор

&НаКлиенте
Процедура КлассификаторВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ОбработкаВыбораЗначенияКлассификатораИзСписка(Элемент.ТекущаяСтрока, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработкаВыбораЗначенияКлассификатораИзСписка(ВыбраннаяСтрока, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗначенияСписка(ВыбраннаяСтрока, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Список.РежимВыбора Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока);
		
		Если ВозвращатьСсылкуНаЭлементКлассификатора Тогда
			Результат = ОбработкаВыбораЗначенияИзСпискаНаСервере(
				ДанныеСтроки.КодТНВЭД,
				ДанныеСтроки.НаименованиеПолное,
				ДанныеСтроки.ВидПродукции,
				Ложь);
			ВыбранноеЗначение = Результат.ЭлементСправочника;
		Иначе
			ВыбранноеЗначение = ДанныеСтроки.КодТНВЭД;
		КонецЕсли;
		
		ОповеститьОВыборе(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗначенияКлассификатораИзСписка(ВыбраннаяСтрока, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ДанныеСтроки = Элементы.Классификатор.ДанныеСтроки(ВыбраннаяСтрока);
	
	Результат = ОбработкаВыбораЗначенияИзСпискаНаСервере(
		ДанныеСтроки.Код,
		ДанныеСтроки.НаименованиеПолное,
		ДанныеСтроки.ВидПродукции,
		ДанныеСтроки.Загружен = 0);
	
	Если ВозвращатьСсылкуНаЭлементКлассификатора Тогда
		ВыбранноеЗначение = Результат.ЭлементСправочника;
	Иначе
		ВыбранноеЗначение = ДанныеСтроки.Код;
	КонецЕсли;
	
	Если Элементы.Список.РежимВыбора Тогда
		ОповеститьОВыборе(ВыбранноеЗначение);
	ИначеЕсли ДанныеСтроки.Загружен = 0 Тогда
		Элементы.Список.Обновить();
		Элементы.Классификатор.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбработкаВыбораЗначенияИзСпискаНаСервере(КодТНВЭД, Наименование, ВидПродукции, Записывать)
	
	Результат = ИнтеграцияИСМП.ПолучитьДанныеСопоставленногоКлассификатораТНВЭД(КодТНВЭД, Наименование);
	
	Если Записывать Тогда
		
		Если ЗначениеЗаполнено(Результат.НаименованиеПолное) Тогда
			НаименованиеПолное = Результат.НаименованиеПолное;
		Иначе
			НаименованиеПолное = Наименование;
		КонецЕсли;
		
		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("КодТНВЭД", КодТНВЭД);
		СтруктураЗаписи.Вставить("ВидПродукции", ВидПродукции);
		СтруктураЗаписи.Вставить("НаименованиеПолное", НаименованиеПолное);
		
		РегистрыСведений.КодыТНВЭДИСМП.ЗаписатьДанныеКода(СтруктураЗаписи);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
